package com.tuoniao.constant;

public interface RegexpConstant {

    /**
     * 日期 yyyy-MM-dd 格式正则
     */
    String DATE_YYYY_MM_DD = "^((?!0000)[0-9]{4}-((0[1-9]|1[0-2])-(0[1-9]|1[0-9]|2[0-8])|(0[13-9]|1[0-2])-(29|30)|(0[13578]|1[02])-31)|([0-9]{2}(0[48]|[2468][048]|[13579][26])|(0[48]|[2468][048]|[13579][26])00)-02-29)$";


    /**
     * 手机号正则
     */
    String PHONE = "^(13[0-9]|14[01456879]|15[0-35-9]|16[2567]|17[0-8]|18[0-9]|19[0-35-9])\\d{8}$";


    /**
     * 匹配正负数
     */
    String POSITIVE_NEGATIVE_NUMBER = "^(\\-?)\\d+(\\.\\d+)?$";

    /**
     * 匹配正整数
     */
    String POSITIVE_NUMBER = "^[1-9]\\d*$";
}
